In [30]:
from sqlalchemy import create_engine

In [31]:
engine = create_engine("mysql+pymysql://root:1234@127.0.0.1:3306/sakila")

In [32]:
import pandas as pd

In [33]:
with engine.connect() as connection:
    df = pd.read_sql_query('SELECT * FROM sakila.rental', connection)

In [34]:
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,None
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,None
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,None
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,None
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,None
...,...,...,...,...,...,...,...,...
15636,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,None
15637,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,None
15638,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,None
15639,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,None
15640,16050,2024-03-30 12:08:07,9,130,2024-03-30 12:08:07,1,2024-03-30 12:08:07,None

In [35]:
with engine.connect() as connection:
    alquileres_may = pd.read_sql_query("SELECT COUNT(rental_id) FROM sakila.rental WHERE MONTH(rental_date)=05;", connection)

In [36]:
alquileres_may = alquileres_may.iloc[0]['COUNT(rental_id)']

In [37]:
with engine.connect() as connection:
    alquileres_jun = pd.read_sql_query("SELECT COUNT(rental_id) FROM sakila.rental WHERE MONTH(rental_date)=06;", connection)

In [38]:
alquileres_jun = alquileres_jun.iloc[0]['COUNT(rental_id)']

In [39]:
if alquileres_may > alquileres_jun:
    print("los alquileres de mayo fueron superiores a los de junio")
elif alquileres_may < alquileres_jun:
    print("los alquileres de junio fueron superiores a los de mayo")
else:
    print('los alquileres son los mismos')

los alquileres de junio fueron superiores a los de mayo